keyestudio/FKS0001-Keyestudio-ESP32-Core-Board-Arduino/Arduino C Tutorial/Libraries/NeoPixel_ESP32/NeoPixel_ESP32.cpp
#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if(is800KHz) {
#endif
    top =       (uint32_t)(F_CPU * 0.00000125); // Bit hi + lo = 1.25 uS
    t0  = top - (uint32_t)(F_CPU * 0.00000040); // 0 = 0.4 uS hi
    t1  = top - (uint32_t)(F_CPU * 0.00000080); // 1 = 0.8 uS hi
#if defined(NEO_KHZ400)
  } else { // 400 KHz bitstream
    top =       (uint32_t)(F_CPU * 0.00000250); // Bit hi + lo = 2.5 uS
    t0  = top - (uint32_t)(F_CPU * 0.00000050); // 0 = 0.5 uS hi
    t1  = top - (uint32_t)(F_CPU * 0.00000120); // 1 = 1.2 uS hi
  }
#endif

  SysTick->LOAD = top;               // Config SysTick for NeoPixel bit freq
  SysTick->VAL  = top;               // Set to start value (counts down)
  (void)SysTick->VAL;                // Dummy read helps sync up 1st bit

  for(;;) {
    *set  = pinMask;                 // Set output high
    ticks = (p & bitMask) ? t1 : t0; // SysTick threshold,
    while(SysTick->VAL > ticks);     // wait for it
    *clr  = pinMask;                 // Set output low
    if(!(bitMask >>= 1)) {           // Next bit for this byte...done?
      if(ptr >= end) break;          // If last byte sent, exit loop
      p       = *ptr++;              // Fetch next byte
      bitMask = 0x80;                // Reset bitmask
    }
    while(SysTick->VAL <= ticks);    // Wait for rollover to 'top'
  }

  SysTick->LOAD = saveLoad;          // Restore SysTick rollover to 1 ms
  SysTick->VAL  = saveVal;           // Restore SysTick value

#elif defined (ARDUINO_STM32_FEATHER) // FEATHER WICED (120MHz)

  // Tried this with a timer/counter, couldn't quite get adequate
  // resolution. So yay, you get a load of goofball NOPs...

  uint8_t  *ptr, *end, p, bitMask;
  uint32_t  pinMask;

  pinMask =  BIT(PIN_MAP[pin].gpio_bit);
  ptr     =  pixels;
  end     =  ptr + numBytes;
  p       = *ptr++;
  bitMask =  0x80;

  volatile uint16_t *set = &(PIN_MAP[pin].gpio_device->regs->BSRRL);
  volatile uint16_t *clr = &(PIN_MAP[pin].gpio_device->regs->BSRRH);

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if(is800KHz) {
#endif
    for(;;) {
      if(p & bitMask) { // ONE
        // High 800ns
        *set = pinMask;
        asm("nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop;");
        // Low 450ns
        *clr = pinMask;
        asm("nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop;");
      } else { // ZERO
        // High 400ns
        *set = pinMask;
        asm("nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop;");
        // Low 850ns
        *clr = pinMask;
        asm("nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop; nop; nop; nop; nop;"
            "nop; nop; nop; nop;");
      }
      if(bitMask >>= 1) {
        // Move on to the next pixel
        asm("nop;");
      } else {
        if(ptr >= end) break;
        p       = *ptr++;
        bitMask = 0x80;
      }
    }
#if defined(NEO_KHZ400)
  } else { // 400 KHz bitstream
    // ToDo!
  }
#endif

#elif defined(TARGET_LPC1768)
  uint8_t  *ptr, *end, p, bitMask;
  ptr     =  pixels;
  end     =  ptr + numBytes;
  p       = *ptr++;
  bitMask =  0x80;

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if(is800KHz) {
#endif
    for(;;) {
      if(p & bitMask) {
        // data ONE high
        // min: 550 typ: 700 max: 5,500
        gpio_set(pin);
        time::delay_ns(550);
        // min: 450 typ: 600 max: 5,000
        gpio_clear(pin);
        time::delay_ns(450);
      } else {
        // data ZERO high
        // min: 200  typ: 350 max: 500
        gpio_set(pin);
        time::delay_ns(200);
        // data low
        // min: 450 typ: 600 max: 5,000
        gpio_clear(pin);
        time::delay_ns(450);
      }
      if(bitMask >>= 1) {
        // Move on to the next pixel
        asm("nop;");
      } else {
        if(ptr >= end) break;
        p       = *ptr++;
        bitMask = 0x80;
      }
    }
#if defined(NEO_KHZ400)
  } else { // 400 KHz bitstream
    // ToDo!
  }
#endif
#elif defined(ARDUINO_ARCH_STM32) || defined(ARDUINO_ARCH_ARDUINO_CORE_STM32)
  uint8_t           *p   = pixels, *end = p + numBytes,
                    pix = *p++, mask = 0x80;
  uint32_t          cyc;
  uint32_t saveLoad = SysTick->LOAD, saveVal = SysTick->VAL;
#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if(is800KHz) {
#endif
    uint32_t top = (F_CPU /  800000);       // 1.25µs
    uint32_t t0  = top - (F_CPU / 2500000); // 0.4µs
    uint32_t t1  = top - (F_CPU / 1250000); // 0.8µs
    SysTick->LOAD = top - 1; // Config SysTick for NeoPixel bit freq
    SysTick->VAL  = 0; // Set to start value
    for(;;) {
      LL_GPIO_SetOutputPin(gpioPort, gpioPin);
      cyc = (pix & mask) ? t1 : t0;
      while(SysTick->VAL > cyc);
      LL_GPIO_ResetOutputPin(gpioPort, gpioPin);
      if(!(mask >>= 1)) {
        if(p >= end) break;
        pix       = *p++;
        mask = 0x80;
      }
      while(SysTick->VAL <= cyc);
    }
#if defined(NEO_KHZ400)
  } else { // 400 kHz bitstream
    uint32_t top = (F_CPU /  400000);       // 2.5µs
    uint32_t t0  = top - (F_CPU / 2000000); // 0.5µs
    uint32_t t1  = top - (F_CPU /  833333); // 1.2µs
    SysTick->LOAD = top - 1; // Config SysTick for NeoPixel bit freq
    SysTick->VAL  = 0;       // Set to start value
    for(;;) {
      LL_GPIO_SetOutputPin(gpioPort, gpioPin);
      cyc = (pix & mask) ? t1 : t0;
      while(SysTick->VAL > cyc);
      LL_GPIO_ResetOutputPin(gpioPort, gpioPin);
      if(!(mask >>= 1)) {
        if(p >= end) break;
        pix       = *p++;
        mask = 0x80;
      }
      while(SysTick->VAL <= cyc);
    }
  }
#endif // NEO_KHZ400
  SysTick->LOAD = saveLoad;          // Restore SysTick rollover to 1 ms
  SysTick->VAL  = saveVal;           // Restore SysTick value
#elif defined (NRF51)
  uint8_t          *p   = pixels,
                    pix, count, mask;
  int32_t         num = numBytes;
  unsigned int bitmask = ( 1 << g_ADigitalPinMap[pin] );
// https://github.com/sandeepmistry/arduino-nRF5/blob/dc53980c8bac27898fca90d8ecb268e11111edc1/variants/BBCmicrobit/variant.cpp

  volatile unsigned int *reg = (unsigned int *) (0x50000000UL + 0x508);

// https://github.com/sandeepmistry/arduino-nRF5/blob/dc53980c8bac27898fca90d8ecb268e11111edc1/cores/nRF5/SDK/components/device/nrf51.h
// http://www.iot-programmer.com/index.php/books/27-micro-bit-iot-in-c/chapters-micro-bit-iot-in-c/47-micro-bit-iot-in-c-fast-memory-mapped-gpio?showall=1
// https://github.com/Microsoft/pxt-neopixel/blob/master/sendbuffer.asm

  asm volatile(
    // "cpsid i" ; disable irq

    //    b .start
    "b  L%=_start"                    "\n\t"
    // .nextbit:               ;            C0
    "L%=_nextbit:"                    "\n\t"          //;            C0
    //    str r1, [r3, #0]    ; pin := hi  C2
    "strb %[bitmask], [%[reg], #0]"   "\n\t"          //; pin := hi  C2
    //    tst r6, r0          ;            C3
    "tst %[mask], %[pix]"             "\n\t"//          ;            C3
    //    bne .islate         ;            C4
    "bne L%=_islate"                  "\n\t"          //;            C4
    //    str r1, [r2, #0]    ; pin := lo  C6
    "strb %[bitmask], [%[reg], #4]"   "\n\t"          //; pin := lo  C6
    // .islate:
    "L%=_islate:"                     "\n\t"
    //    lsrs r6, r6, #1     ; r6 >>= 1   C7
    "lsr %[mask], %[mask], #1"       "\n\t"          //; r6 >>= 1   C7
    //    bne .justbit        ;            C8
    "bne L%=_justbit"                 "\n\t"          //;            C8

    //    ; not just a bit - need new byte
    //    adds r4, #1         ; r4++       C9
    "add %[p], #1"                   "\n\t"          //; r4++       C9
    //    subs r5, #1         ; r5--       C10
    "sub %[num], #1"                 "\n\t"          //; r5--       C10
    //    bcc .stop           ; if (r5<0) goto .stop  C11
    "bcc L%=_stop"                    "\n\t"          //; if (r5<0) goto .stop  C11
    // .start:
    "L%=_start:"
    //    movs r6, #0x80      ; reset mask C12
    "movs %[mask], #0x80"             "\n\t"          //; reset mask C12
    //    nop                 ;            C13
    "nop"                             "\n\t"          //;            C13

    // .common:               ;             C13
    "L%=_common:"                     "\n\t"          //;            C13
    //    str r1, [r2, #0]   ; pin := lo   C15
    "strb %[bitmask], [%[reg], #4]"   "\n\t"          //; pin := lo  C15
    //    ; always re-load byte - it just fits with the cycles better this way
    //    ldrb r0, [r4, #0]  ; r0 := *r4   C17
    "ldrb  %[pix], [%[p], #0]"        "\n\t"          //; r0 := *r4   C17
    //    b .nextbit         ;             C20
    "b L%=_nextbit"                   "\n\t"          //;             C20

